In [1]:
import pandas as pd

In [4]:
s = pd.Series([1,2,3,4,5],index=['A','B','C','D','E'])

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [7]:
#Reindexing method : 
s.reindex(['E','D','C','B','A','F'])

E    5.0
D    4.0
C    3.0
B    2.0
A    1.0
F    NaN
dtype: float64

In [17]:
#Fill spaces with reindex
s2=pd.Series(['Ok','Google','OOP'],[1,3,5])
s2.reindex(range(1,6),method='ffill')

1        Ok
2        Ok
3    Google
4    Google
5       OOP
dtype: object

In [21]:
#lets use reindex in DataFrame
import numpy as np

In [24]:
df = pd.DataFrame(np.arange(9).reshape(3,3),index=['One','Two','Three'],columns=['Elmir','Abidin','Orxan'])
df

       Elmir  Abidin  Orxan
One        0       1      2
Two        3       4      5
Three      6       7      8

In [26]:
df = df.reindex(['Three','Two','One'])
df

       Elmir  Abidin  Orxan
Three      6       7      8
Two        3       4      5
One        0       1      2

In [32]:
#Indexing with 'loc'
df.loc[['Two','One','Three']]
df

       Elmir  Abidin  Orxan
Three      6       7      8
Two        3       4      5
One        0       1      2

In [38]:
#We are use 'drop' for delete something
new_df = df.drop('Three')
new_df

     Elmir  Abidin  Orxan
Two      3       4      5
One      0       1      2

In [42]:
#Multi dropping
new_df = df.drop(['Two','One'])
new_df

       Elmir  Abidin  Orxan
Three      6       7      8

In [44]:
# axis = 1 --> Delete column (or axis='columns')
# axis = 0 (default) --> Delete row (or axis='index')
new_df = df.drop('Orxan',axis=1)
new_df

       Elmir  Abidin
Three      6       7
Two        3       4
One        0       1

In [46]:
#Use axis method in mean() function
df.mean()

Elmir     3.0
Abidin    4.0
Orxan     5.0
dtype: float64

In [47]:
df.mean(axis=1)

Three    7.0
Two      4.0
One      1.0
dtype: float64

In [48]:
df.mean(axis=0)

Elmir     3.0
Abidin    4.0
Orxan     5.0
dtype: float64